socialNetwork/wrk2/test-run-11th-sept-1/COMMAND_18/52
Running 1m test @ http://localhost:31111/wrk2-api/user-timeline/read
  8 threads and 16 connections
  Thread calibration: mean lat.: 10.721ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 103.545ms, rate sampling interval: 465ms
  Thread calibration: mean lat.: 11.920ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 90.003ms, rate sampling interval: 431ms
  Thread calibration: mean lat.: 217.373ms, rate sampling interval: 661ms
  Thread calibration: mean lat.: 202.198ms, rate sampling interval: 627ms
  Thread calibration: mean lat.: 14.544ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 108.384ms, rate sampling interval: 565ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   489.40ms  614.02ms   1.80s    77.16%
    Req/Sec    93.90     27.15   148.00     81.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.47ms
 75.000%    1.05s 
 90.000%    1.49s 
 99.000%    1.80s 
 99.900%    1.92s 
 99.990%    1.93s 
 99.999%    1.94s 
100.000%    1.94s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.051     0.000000            1         1.00
       9.063     0.100000         3671         1.11
      10.615     0.200000         7341         1.25
      12.175     0.300000        11015         1.43
      14.111     0.400000        14685         1.67
      17.471     0.500000        18349         2.00
      22.239     0.550000        20184         2.22
     436.479     0.600000        22019         2.50
     689.663     0.650000        23855         2.86
     875.519     0.700000        25690         3.33
    1047.039     0.750000        27524         4.00
    1115.135     0.775000        28450         4.44
    1160.191     0.800000        29371         5.00
    1250.303     0.825000        30281         5.71
    1360.895     0.850000        31197         6.67
    1447.935     0.875000        32119         8.00
    1464.319     0.887500        32581         8.89
    1488.895     0.900000        33037        10.00
    1535.999     0.912500        33507        11.43
    1569.791     0.925000        33959        13.33
    1600.511     0.937500        34409        16.00
    1632.255     0.943750        34634        17.78
    1657.855     0.950000        34882        20.00
    1671.167     0.956250        35107        22.86
    1684.479     0.962500        35337        26.67
    1697.791     0.968750        35552        32.00
    1710.079     0.971875        35675        35.56
    1720.319     0.975000        35784        40.00
    1738.751     0.978125        35897        45.71
    1754.111     0.981250        36011        53.33
    1766.399     0.984375        36126        64.00
    1780.735     0.985938        36185        71.11
    1787.903     0.987500        36249        80.00
    1794.047     0.989062        36297        91.43
    1804.287     0.990625        36354       106.67
    1815.551     0.992188        36412       128.00
    1818.623     0.992969        36446       142.22
    1821.695     0.993750        36474       160.00
    1824.767     0.994531        36503       182.86
    1828.863     0.995313        36531       213.33
    1832.959     0.996094        36561       256.00
    1836.031     0.996484        36572       284.44
    1839.103     0.996875        36586       320.00
    1843.199     0.997266        36597       365.71
    1859.583     0.997656        36612       426.67
    1882.111     0.998047        36626       512.00
    1895.423     0.998242        36633       568.89
    1905.663     0.998437        36641       640.00
    1910.783     0.998633        36648       731.43
    1915.903     0.998828        36657       853.33
    1918.975     0.999023        36664      1024.00
    1919.999     0.999121        36667      1137.78
    1921.023     0.999219        36669      1280.00
    1923.071     0.999316        36673      1462.86
    1925.119     0.999414        36681      1706.67
    1925.119     0.999512        36681      2048.00
    1925.119     0.999561        36681      2275.56
    1926.143     0.999609        36686      2560.00
    1926.143     0.999658        36686      2925.71
    1927.167     0.999707        36687      3413.33
    1928.191     0.999756        36691      4096.00
    1928.191     0.999780        36691      4551.11
    1928.191     0.999805        36691      5120.00
    1928.191     0.999829        36691      5851.43
    1930.239     0.999854        36692      6826.67
    1931.263     0.999878        36694      8192.00
    1931.263     0.999890        36694      9102.22
    1931.263     0.999902        36694     10240.00
    1931.263     0.999915        36694     11702.86
    1933.311     0.999927        36695     13653.33
    1933.311     0.999939        36695     16384.00
    1933.311     0.999945        36695     18204.44
    1936.383     0.999951        36696     20480.00
    1936.383     0.999957        36696     23405.71
    1936.383     0.999963        36696     27306.67
    1936.383     0.999969        36696     32768.00
    1936.383     0.999973        36696     36408.89
    1939.455     0.999976        36697     40960.00
    1939.455     1.000000        36697          inf
#[Mean    =      489.405, StdDeviation   =      614.016]
#[Max     =     1938.432, Total count    =        36697]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  44041 requests in 1.00m, 543.59MB read
Requests/sec:    734.01
Transfer/sec:      9.06MB